Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/adoption_and_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Adoption and cohabiting couples
ga: Uchtáil agus lánúineacha comhchónaithe

source: The non-marital family is not recognised by the Irish Constitution and it does not possess the same legal rights and obligations as the family based on marriage
ga: Níl aon aitheantas tugtha don teaghlach neamhphósta faoi Bhunreacht na hÉireann agus níl na cearta agus oibleagáidí dlíthiúla céanna aige agus atá ag teaghlach atá bunaithe ar phósta

source: Under the Adoption Act 2010, a child may be adopted by married couples, a mother or father of the child or a relative of the child
ga: Faoin Acht Uchtála 2010, is le lánúineacha pósta, athair nó máthair an linbh, gaol leis an leanbh, leanbh a uchtú

source: In specific cases, the Adoption Authority of Ireland may decide that it is desirable that some other person can adopt a child
ga: I gcásanna sonracha, féadfaidh Údarás Uchtála na hÉireann cinneadh a dhéanamh go mbeadh sé inmhianaithe go bhféadfadh duine éigin eile an leanbh a uchtú

source: Unmarried couples may not jointly adopt a child
ga: Ní féidir le lánúineacha neamhphósta leanbh a chomhuchtú

source: A joint adoption by a couple is only possible where that couple is married and living together
ga: Ní féidir leo an leanbh a chomhuchtú ach amháin nuair atá siad pósta agus ina gcónaí le chéile

source: This rule prevents an unmarried couple from jointly adopting a child even where one of the parties is the biological or legal parent of the child
ga: Cuireann an riail seo cosc ar lánúineacha neamhphósta leanbh a chomhuchtú fiú amháin más tuismitheoir bitheolaíoch nó dlíthiúil an linbh duine acu

source: There are no proposals to change adoption law in Ireland to permit adoption by unmarried couples
ga: Níl moltaí ar bith ann go n-athrófar an dlí uchtála in Éirinn le cead a thabhairt do lánúineacha neamhphósta leanbh a uchtú

source: Under the adoption legislation, it is possible for a single person to adopt if the Adoption Authority considers it desirable and it must regard the welfare of the child as its first and paramount consideration
ga: De réir na reachtaíochta uchtála, is féidir le duine singil uchtú a dhéanamh má mheasann an tÚdarás Uchtála go bhfuil sé inmhianaithe agus ní foláir dó leas an linbh a ghlacadh mar an gcéad ní agus an ní is tábhachtaí

source: This means that if you are living with a same-sex or opposite-sex partner, you may apply to the Authority to adopt a child in your own right, intending to raise the child with your partner
ga: Ciallaíonn seo, má bhíonn tú i do chónaí le páirtí comhghnéis nó malairtghnéis, féadfaidh tú iarratas a dhéanamh ar an Údarás chun leanbh a uchtú as do stuaim féin agus tú ag dréim leis an leanbh a thógáil aníos le do pháirtí

source: However, your partner would have no legal rights in relation to the child
ga: Bíodh sin mar atá, ní bheadh cearta dlíthiúla ar bith ag do pháirtí maidir leis an leanbh

source: The fact you are in a relationship is relevant only when evaluating circumstances that might affect the child's welfare
ga: Cé go bhfuil tú i gcaidreamh, ní bhaineann tábhacht leis seo ach amháin nuair a bhíonn na cúinsí á measúnú a d’fhéadfadh difear a dhéanamh do leas an linbh

source: For a foreign adoption to be recognised in Ireland, it must comply with the definition of adoption in Irish law
ga: Chun uchtáil choigríche a bheith aitheanta in Éirinn, caithfidh sí cloí le sainmhíniú na huchtála faoi mar a shonraítear é i ndlí na hÉireann

source: This means that the rule that only married couples may jointly adopt will apply
ga: Ciallaíonn sin go mbeidh an riail i gceist nach bhféadfaidh ach lánúineacha pósta comhuchtú a dhéanamh

source: Step-parent adoption refers to the adoption of a child by the birth mother (usually) and her spouse, who is not the birth father of the child
ga: Tagraíonn uchtú ag leastuismitheoir uchtú linbh ag an máthair bhreithe (de ghnáth) agus a fear céile, nach athair breithe an linbh é

source: If only her spouse adopted the child she would lose her rights and responsibilities in relation to the child and would no longer be the child's guardian
ga: Dá ndéanfadh a fear céile amháin an leanbh a uchtú, chaillfeadh sí a cuid cearta agus freagrachtaí maidir leis an leanbh agus ní bheadh sí mar chaomhnóir an linbh a thuilleadh

source: As mentioned previously they must be married to each other for both of them to be able to adopt
ga: Mar a luadh cheana, ní mór dóibh bheith pósta lena chéile má tá an bheirt acu in ann uchtú

source: They will then both be adoptive parents
ga: Beidh siad beirt ina dtuismitheoirí uchtaíocha ansin

source: You can find out about step-parent adoption on the Adoption Authority's website
ga: Is féidir leat faisnéis a fháil faoin leastuimitheoir uchtála ar láithreán gréasáin Údarás Uchtála na hÉireann

source: When a child is being adopted there is a requirement to consult the birth father
ga: Nuair a bhíonn leanbh á uchtáil, tá riachtanas ann go rachfaí i gcomhairle leis an athair breithe

source: If the birth father is a guardian his consent is required
ga: Má tá an t-athair breithe ina chaomhnóir, ní mór a thoiliú a fháil

source: You can read more about adoption and consent here
ga: Is féidir leat tuilleadh faisnéise a léamh faoi uchtú agus faoi thoiliú anseo

source: Further information about adoption is available from your local Child and Family Agency adoption service
ga: Tá tuilleadh faisnéise ar fáil faoi uchtáil ó an Ghníomhaireacht um Leanaí agus an Teaghlach
